class AppString {
  //AppName
  static String get baseUrl => "https://emachine.next-tech.co/api/user/";
  static String get appName => "قراءة عدادات";
  static String get next => "الاستمرار";
  static String get currency => "ريال سعودي";
  static String get photoAattached => "تم إرفاق صورة";

  //Auth
  static String get welcame => "اهلا بك , ادخل بياناتك لمتابعة تقدمك  ";
  static String get pleaseLogin =>
      "أهلا بك من جديد، قم بتسجيل الدخول إلى حسابك";
  static String get username => "اسم المستخدم";
  static String get firstName => "الإسم الاول";
  static String get secondName => "الإسم الاخير";
  static String get password => "كلمة المرور";
  static String get confirmPassword => "تأكيد كلمة المرور";
  static String get mobile => "رقم الجوال";
  static String get email => "البريد الإلكتروني";
  static String get forgetPassword => "نسيت كلمة المرور ؟";
  static String get recentPassword => "استعادة كلمة المرور";
  static String get login => "تسجيل الدخول";
  static String get sendCode => "ارسال الرمز";
  static String get noAccount => "ليس لديك حساب ؟";
  static String get yesAccount => "لديك حساب ؟";
  static String get createNewAccount => "إنشاء حساب جديد";
  static String get loginByGoogle => "تسجيل الدخول بواسطة جوجل";
  static String get or => "أو";
  static String get contactInfo => "معلومات التواصل";
  static String get accountInfo => "معلومات الحساب";
  static String get createAcoount => "إنشاء الحساب";
  static String get infoForgetPassword =>
      "سوف يتم ارسال الرمز السري الى البريد الالكتروني المسجل في سجلاتنا";
  static String get infoOtpPassword =>
      "لقد قمنا بإرسال كود التفعيل برسالة عبر الايميل support@gmail.com";

  //Home
  static String get electroniContract => "عقد ايجار الكتروني موثق";
  static String get soudiaArabia => "المملكة العربية السعودية";
  static String get infoContract =>
      "الان أبرم عقدك المعتمد بنفسك من إيجار والهيئة العامة للعقار. نحن خيارك الأسرع من أي مكان في";
  static String get residentialContract => "عقد سكني";
  static String get commercialContract => "عقد تجاري";
  static String get completeProcedures =>
      "لاستكمال الاجراءات يجب عليك تجهيز الأوراق التالية";
  static String get landlordAndTenant => "بيانات المالك والمستأجر";
  static String get ipan => "رقم الحساب البنكي للمالك (الايبان)";
  static String get instrumentInformation => "معلومات الصك";
  static String get rentedUnitData => "بيانات الوحدة المؤجرة";
  static String get contractValueYear =>
      "قيمة العقد للسنة الواحدة 350 ريال  فقط";
  static String get writingContract => "كتابة العقد";
  static String get servicesPricing => "تسعيرة الخدمات";
  static String get priceCreateContract => "سعر إنشاء العقد";
  static String get governmentEjarNetwork => "شبكة ايجار الحكومية";
  static String get absherAndSMSDocumentationFees => "رسوم توثيق أبشر و SMS";
  static String get corporation => "مؤسسة (عقد ايجار)";
  static String get taxValue => "ضريبة القيمة المضافة";
  static String get total => "المجموع";
  static String get done => "اتفقنا";

  //Profile
  static String get homeScreen => "الصفحة الرئيسية";
  static String get createResidentialContract => "إنشاء عقد سكني";
  static String get createCommercialContract => "إنشاء عقد تجاري";
  static String get myContract => "عقودي";
  static String get language => "اللغة";
  static String get privacy => "سياسة الاستخدام والخصوصية";
  static String get trem => "الشروط والاحكام";
  static String get fqa => "الاسئلة الشائعة";
  static String get copyWrite => "جميع الحقوق محفوظة";

  //Contract
  static String get ownerData => "بيانات المالك";
  static String get steps => "خطوات";
  static String get nextPage => "التالي";
  static String get previousPage => "السابق";
  static String get instrumenData => "بيانات الصك";
  static String get imageInstrumen => "الرجاء ارفاق صورة الصك (PNG,JPG)";
  static String get addTaxonPrice => "سوف يتم اضافة 55 ر.س على السعر الأصلي";
  static String get chooseTypeInstrument => "اختر نوع الصك";
  static String get electronicInstrument => "صك الكتروني";
  static String get ancientHandwrittenInstrument => "صك قديم مكتوب بخط اليد";
  static String get argumentConsistency => "حجة استحكام";
  static String get isOwnerDeceased => "هل صاحب العقار متوفي ؟";
  static String get addLegalRepresentativeforOwner =>
      "هل تود اضافة ممثل نظامي او وكيل شرعي لمالك العقار ؟";
  static String get addLegalRepresentativeForTenant =>
      "هل تود اضافة ممثل نظامي او وكيل شرعي لمستأجر العقار ؟";
  static String get yes => "نعم";
  static String get owner => 'مالك';
  static String get no => "لا";
  static String get yesDeceased => "نعم , متوفي";
  static String get noAlive => "لا، على قيد الحياة";
  static String get propertyType => "نوع العقار";
  static String get propertyUse => "استخدام العقار";
  static String get propertyArea => "منطقة العقار";
  static String get city => "المدينة";
  static String get district => "الحي";
  static String get buildingNo => "رقم المبنى";
  static String get zipCod => "رمز البريد";
  static String get extraNo => "رقم الاضافي";
  static String get instrumenNo => "رقم الصك";
  static String get instrumendate => "تاريخ الصك";
  static String get sendContract => "ارسال العقد للتوثيق";
  static String get onwerIdNo => "رقم هوية المالك";
  static String get onwerDateAd => "تاريخ ميلاد المالك ( ميلادي )";
  static String get onwerDateHijri => "تاريخ ميلاد المالك ( هجري )";
  static String get onwerMoile => "رقم جوال المالك";
  static String get onwerIBAN => "رقم أيبان الحساب البنكي";
  static String get agentInformation => "معلومات الوكيل";
  static String get agentId => "رقم هوية الوكيل";
  static String get agentDateAd => "تاريخ الميلاد ( ميلادي )";
  static String get agentDateHijri => "تاريخ الميلاد ( هجري )";
  static String get agentMoile => "رقم جوال الوكيل";
  static String get agencyNoInstrument => "رقم الوكالة بالصك";
  static String get agencyDateInstrument => "تاريخ صك الوكالة";
  static String get tenantData => "بيانات المستأجر";
  static String get tenantId => "رقم هوية المستأجر";
  static String get tenantMobile => "رقم جوال المستأجر";

  //page3
  static String get tenantEntity => "كيان المستأجر";
  static String get person => "فرد";
  static String get company => "شركة";
  static String get area => "المنطقة";
  static String get unifiedRegistrationNo => "الرقم الموحد للسجل";
  static String get delegationType => "نوع التفويض";
  static String get ownerRepresentativeRecord => "أنا مالك السجل وممثله";
  static String get agentForTenant => "أنا وكيل عن المستأجر";
  static String get imageAgency => "صورة من التفويض أو الوكالة (PNG,JPG)";

  //page4
  static String get myChoice => "اختياري";
  static String get unitNumber => "رقم الوحدة";
  static String get unitType => "نوع الوحدة";
  static String get numberRooms => "عدد الغرف";
  static String get unitUse => "استخدام الوحدة";
  static String get flooNumber => "رقم الطابق";
  static String get unitArea => "مساحة الوحدة";
  static String get electricityMeterNumber => "رقم عداد الكهرباء";
  static String get waterMeterNumber => "رقم عداد الماء";
  static String get numberAirConditionersUnit => "عدد المكيفات الوحدة";

  //page5
  static String get financialStatements => "البيانات المالية";
  static String get contractStartingDate => "تاريخ بداية العقد";
  static String get durationContractYear => "مدة العقد بالسنة";
  static String get annualRentalAmounUnit => "مبلغ الايجار السنوي للوحدة";
  static String get paymentMethod => "طريقة الدفعات";
  static String get dailyFine => "الغرامة اليومية";
  static String get clarification => "توضيح";
  static String get subDelay => "التأخير من الباطن";
  static String get wouldLikeConditions => "هل تود اضافة شروط اخرى ؟";
  static String get isConditions => "من خلال إنشاء حساب ، فإنك توافق على";
  static String get privacyAndTrem => "الشروط والأحكام الخاصة بنا";
  static String get freePremiuMmembership => "هل تود عضوية مميزة مجانا";

  //paymentContract
  static String get applicationFees => "رسوم التطبيق";
  static String get governmentRent => "ايجار الحكومية";
  static String get valueAddedTax => "ضريبة القيمة المضافة";
  static String get totalContrat => "الاجمالي";
  static String get typeBankAccount => "نوع الحساب البنكي";
  static String get accountOwner => "صاحب الحساب";
  static String get nameOwner => "الاسم";
  static String get bnak => "البنك";
  static String get iBAN => "رقم الايبان";
  static String get nameAccountTransfe => "اسم صاحب الحساب الذي تم التحويل منه";
  static String get imageReceipt =>
      "الرجاء ارفاق صورة الايصال قبل ارسال الطلب (PNG,JPG)";
  static String get receiptAttached => "تم ارفاق الايصال (ارسال الطلب الان )";
  static String get paymentAfterSending => "الدفع بعد ارسال مسودة";
  static String get alert => "تنبيه";
  static String get agreePaySubmitting => "أوافق على الدفع بعد ارسال مسودة";
  static String get cancel => "الغاء";
  static String get ok => "موافق";
  static String get download => "تحميل";
  static String get paymentSendReal => "الدفع لارسال نسخة حقيقية";
  static String get communicateModifyDraft => "التواصل لتعديل المسودة";
  static String get ratingMatters => "تقييمك يهمنا !";
  static String get rateNow => "قيم الان";
}

class AppTrem {
  //AppName
  static String get termsAndConditions =>
      """ الشروط والأحكام
شروط وأحكام استخدام الموقع الرسمي لشركة (مجموعة سيرا القابضة ) على (الإنترنت)
مرحبا بكم في الموقع الرسمي لشركة (مجموعة سيرا القابضة) على شبكة (الإنترنت) ويشار إليه في هذه الشروط والأحكام بلفظ "الموقع"
الإطلاع وقراءة شروط استخدام الموقع:
تخضع عملية الدخول إلى الموقع والتصفح وتنزيل المواد ونسخها باستخدام هذا الموقع (ويشار إلى هذه العملية بلفظ "الاستخدام") و/أو أي معلومات أو مواد من هذا الموقع للأحكام والشروط المبينة أدنـاه ("الشروط")، لذا يرجى قراءة هذه الشروط ، وعلى وجه الخصوص بيان الخصوصية والسرية ، بعناية قبل استخدام هذا الموقع.
بالنفاذ والدخول إلى هذا الموقع واستخدامه يفترض أن يكون المستخدم قد اطلع على هذه الأحكام والشروط وفهم فحواها وتشكل شروط الاستخدام -كما هي موضحة أدناه – عقدًا بينك وبين سيرا وإن استخدامك لهذا الموقع يعد قبولاً بما ورد بهذه الأحكام والشروط ، وفي حالة عدم التقيد بهذه الشروط فيجب عليك وقف استخدام هذا الموقع فوراً.
يرجى ملاحظة أن هذه الشروط قد تتغير من وقتٍ لآخر كلما دعت الضرورة دون أي إشعار ويجب على مستخدمو الموقع قراءة الشروط والتغييرات المحتملة بانتظام. وعند الرغبة في الحصول على نسخة مطبوعة ، يرجى إرسال رسالة إلكترونية شاملة عنوان المراسلة الذي يمكننا التواصل معكم عن طريقه .
ملكية الموقع ومحتوياته:
تعود ملكية هذا الموقع ومحتوياته ومسئولية تشغيله وإدارته لشركة مجموعة سيرا القابضة (سيرا) ، وهي شركة تأسست بموجب أنظمة وقوانين المملكة العربية السعودية ("المملكة العربية السعودية") ومقرها الرئيس الكائن على شارع التخصصي بحي العليا، في مدينة الرياض بالمملكة العربية السعودية ، هاتف : 00966114633667.
إن الموقع ، وأية بيانات ، أو مواد ، أو توصيات ، أو خدمات أو غيرها من المواد المنشورة على الموقع ، أو مرتبطة بها ("معلومات")، مقدمة من سيرا بالمجان وبحسن نية ، ولكن على أساس "كما هي" ، وللعلم فقط . وليس الغرض منها معالجة الاحتياجات الخاصة.
الاستخدام المصرح به وإساءة استخدام الموقع:
تمنحك سيرا رخصة محدودة مقيدة وشخصية وغير قابلة للتحويل وغير قابلة للتعهيد من الباطن وقابلة للإلغاء للوصول إلى الموقع واستخدامه فقط على النحو المسموح به صراحةً في شروط الاستخدام. باستثناء هذه الرخصة المحدودة، لا نمنحك أي حقوق أو رخص أخرى فيما يتعلق بالموقع، ونحتفظ بأية حقوق أو رخص غير ممنوحة صراحةً في الموقع. المحتوى والمعلومات الموجودة في الموقع وكذلك البرامج والبنية التحتية المستخدمة لتوفير ذلك المحتوى والمعلومات تكون ملكية حصرية لشركة سيرا.
وبناءً على ذلك، وكشرط لاستخدام الموقع، فإنك توافق على عدم استخدام الموقع أو محتوياته أو المعلومات لأي غرض تجاري أو غير شخصي (مباشر أو غير مباشر) أو لأي غرض غير قانوني أو غير شرعي أو محظور بموجب شروط الاستخدام أو بموجب القانون او الآداب العامة. كما توافق على عدم تعديل أو نسخ أو توزيع أو نقل أو عرض أو أداء أو إعادة إنتاج أو نشر أو ترخيص أو خلق صور اشتقاقية من أو تحويل أو بيع أو إعادة بيع أي معلومات أو برامج أو منتجات أو خدمات تم الحصول عليها من الموقع دون الحصول على موافقتنا الخطية المسبقة. بالإضافة إلى ذلك، فإنك توافق على عدم القيام بما يلي:
بث أي مواد ترويجية غير مصرح بها ، أو أي شكل آخر من أشكال الإغواء ("spam") .
استخدام الموقع أو محتوياته لأي غرض تجاري هو استخدام غير مصرح به.
نشر أي معلومات و/او بيانات و/أو اعلانات و/أو تسويق أي منتج و/أو التحريض على فعل أو الامتناع على فعل اعتبرته الشريعة الاسلامية و/أو القانون و/أو النظام العام و/أو الاداب العامة على سبيل المثال لا الحصر : جريمة و/أو مخالفة و/أو انتهاك و/أو إساءة و/أو تعدي و/أو إضطهاد عرقي.
نقل أية بيانات تحتوي على فيروسات وبرامج تجسس أو برامج أخرى ضارة
كشف وإفشاء المواد ومشاركتها أو نشر المواد التي قد تتعدى على حقوق الملكية الفكرية لأي شخص أو جهة ، أو قد تكون مهينة أو تشهيرية ، أو محظورة .
الوصول إلى أي محتوى أو معلومات في الموقع أو مراقبتها أو نسخها باستخدام برنامج آلي أو عنكبوتي أو كاشطة أو غيرها من الوسائل المؤتمتة أو أية عملية يدوية لأي غرض دون الحصول على إذننا الخطي الصريح المسبق.
العبث بالبيانات والمعلومات، ومحاولة تعديل أو إتلاف أي إجراءات أمنية أو توثيقية.
إعادة بيع أو استخدام أو نسخ أو مراقبة (بواسطة أي برنامج) أو عرض أو تحميل أو إعادة إنتاج أي محتوى أو معلومات أو برامج أو "نسخ" أو "محاكاة" أو بخلاف ذلك دمج أي جزء من الموقع في أي موقع إلكتروني آخر دون الحصول على موافقة كتابية مسبقة من سيرا
لا ضمانات ولا مسؤولية على الشركة:
تبذل سيرا جهدها بأن تكون المعلومات والخدمات في موقعها الإلكتروني دقيقة وقت النشر بقدر المستطاع، إلا أنها لا تقدم أي ضمان صريح أو ضمني أو تأكيدات حول دقة المعلومات وشمولها.
سيقوم المستخدم بالدخول للموقع واستخدام المعلومات بمحض اختياره وإرادته ويتحمل المخاطر التي قد تترتب على ذلك ، على النحو المبين في هذه الشروط.. ويبقى المستخدم مسئولاً وحده عن تقييم وتفسير المعلومات والتحقق منها قبل استخدامها أو الاعتماد عليها.
تعلن سيرا صراحة رفضها أية مطالبات أو ضمانات من أي نوع ، سواء صراحةً أو ضمناً ، على دقة واكتمال المعلومات الواردة عبر هذا الموقع لغرض معين ، و/ أو أي خدمة أو منتج .
حدود المسؤولية القانونية:
لا تتحمل سيرا أية مسؤولية عن أية آثار أو أضرار أو خسائر من أي نوع وبأية طريقة نتيجة عن أو فيما يتعلق بالدخول أو عدم القدرة للوصول إلى هذا الموقع ، ولا عن الاستخدام أو الاعتماد على أي من المعلومات الواردة عبر هذا الموقع ، ومن بينها على سبيل المثال لا الحصر ، الفيروسات التي يمكن أن تصيب المعدات والبرمجيات الحاسوبية أو البيانات ، والى أقصى حد لهذه المسؤولية يمكن أن يستبعد بموجب القانون. كذلك لا تتحمل سيرا المسئولية عن الأضرار الناجمة عن استخدام وسائل الاتصال الإلكترونية ، ومنها على سبيل المثال لا الحصر ، الأضرار الناتجة عن تأخير ، أو فشل إيصال الرسائل الإلكترونية ، أو الاعتراض أو التلاعب بالاتصالات الإلكترونية من جانب أطراف ثالثة ، أو برامج الكومبيوتر المستخدمة في إرسال الرسائل الإلكترونية والفيروسات.
الخصوصية والسرية:
إننا إذ نقدر اهتمامكم بالموقع ، نرى أن أحقيتكم في ضمان الخصوصية والسرية هامة بالنسبة لنا. لذلك فإن سيرا ملتزمة بحماية الخصوصية والسرية على هذا الموقع ، وستتخذ الخطوات المعقولة لضمان تخزين ونقل بياناتكم بطريقة آمنة من خلال (الإنترنت) بواسطة التقنيات الحالية المعتادة. وهذا ينطبق على جميع المعلومات الشخصية التي تجمع آلياً أو عن الأدوات التي تسمح للموقع بالاتصال مع كومبيوتر الشخص الزائر أثناء زياراته للموقع ، غير أن سيرا لا تتعهد أو تقدم أية ضمانات بأن بياناتكم ستكون آمنة بنسبة 100٪.
الأدوات المساعدة COOKIES:
يرجى الإحاطة بأنه ربما نقوم بتخزين بعض الأدوات المساعدة في الحاسب الآلي الخاص بكم عند القيام بزيارة موقعنا على (الإنترنت)، أو التسجيل لأية خدمة أو إجراء استفسارات. وهذا يتيح لنا التعرف على حسابكم الآلي عند زيارتكم لنا المرة التالية . ومن المعروف أن معظم متصفحي (الإنترنت) يتقبلون هذه الأدوات المساعدة تلقائياً ، ومن الممكن للمستخدم تحديد استخدام هذه الأدوات بشكل مستقل من خلال ضبط المتصفح الخاص به. علماً أن طبيعة المعلومات التي نحصل عليها محددة عن الحاسب الآلي ، ويمكن أن تشمل عنوان بروتوكول (الإنترنت) ، وتاريخ ووقت النفاذ والوصول لموقعنا على الشبكة وأجزاء الموقع التي تمت زيارتها. إن الغرض من جمع هذه المعلومات هو رصد جدوى استعمال موقعنا على الشبكة لأغراض إحصائية وإرسال معلومات عن شركتنا إليكم ، كذلك منتجاتنا وخدماتنا الجديدة التي تتناسب مع متطلباتكم . وبوسعكم ضبط المتصفح لديكم لإبلاغكم بهذه المعلومات من عدمها أو حجبها أو رفض استقبالها. وفي هذه الحالة قد لا يكون في مقدوركم استخدام جميع الإمكانات المتاحة في الموقع.
جمع واستخدام البيانات :
إننا نجمع البيانات الشخصية عندما نحصل عليها منكم شخصياً ، عن طريق التسجيل ، أو بملء الاستمارات أو عن طريق البريد الإلكتروني ضمن طلب المنتجات أو الخدمات ، أو الاستفسارات أو الطلبات الأخرى في الحالات التي اخترتموها لتقديم المعلومات لنا. وستتم معالجة البيانات وتجهيزها لأغراض الاستجابة و/أو إنجاز أي طلب منك سواءً معلومات أو مشورة ، وتقديم أفضل الخدمات من خلال إرسال المعلومات لكم عن شركتنا و المنتجات أو الخدمات الجديدة التي تلقى منكم الاهتمام. ولهذا الغرض يمكننا أن نشاطركم بيانات الشركات التابعة لنا التي تقوم أيضاً بعملية معالجة البيانات وفقاً لمتطلبات الخصوصية والسرية. وفي كل الأوقات يمكنكم طلب الحصول على البيانات و/ أو تصحيحها و/أو حذفها. ولهذه الأغراض ، يرجى إرسال بريد إلكتروني إلى عنواننا.
المواقع المتصلة مع هذا الموقع:
يمكن أن يوفر هذا الموقع وصلات أو روابط أو مراجع أو غيرها من المواقع الخارجية و/أو الاخرى التي لا ترتبط بسيرا. ولا تنطبق شروط أو احكام استخدام الموقع على هذه الروابط. ويجب التحقق من الأحكام الخاصة بكل موقع على حده، ولا تتحمل سيرا أية مسؤولية عن محتوى تلك المواقع الأخرى .
ويرجى الإحاطة بأن بيان الخصوصية واستخدام الأدوات المساعدة أعلاه لا ينطبق على جمع وتجهيز البيانات بشأن المواقع الأخرى، ولن تكون سيرا مسئولة عن أية إصابات أو أضرار من أي نوع تنشأ عن نفاذكم أو دخولكم لتلك المواقع ، أو عدم القدرة على الوصول أو استخدام هذه المواقع وغيرها من المعلومات المقدمة بشأنها ، ولا الاستخدام أو الاعتماد على أي معلومات أخرى عن هذه المواقع ، علماً أن الغرض من أية روابط للدخول إلى مواقع أخرى لمجرد توفير الراحة لمستخدمي هذا الموقع.
المعلومات المقدمة من المستخدمين:
تحتفظ سيرا بحرية استخدام أو نسخ جميع الاتصالات والمعلومات و/أو المواد المقدمة أو المرسلة من المستخدم عبر الموقع في أي استفسارات و/أو تبادل معنا ("المواد"). وبإرسال مثل هذه المواد إلى سيرا ، يعني أنك توافق على استخدامها من قبل سيرا وفق تقديرها . ولا تسعى سيرا للحصول على أية مواد حساسة أو بيانات تتسم بطابع الملكية الخاصة أو معلومات سرية من الزوار. ويجب عليك توخي الحذر، ونقترح عليك عدم وضع مواد من هذا النوع في الموقع . وبهذا توافق على تعويض وحماية سيرا من أية أضرار وإخلاء مسئوليتها ضد جميع المطالبات والمسؤوليات التي قد تتحملها أو تتكبدها نتيجة لاستعمال و/أو استغلال هذه المواد.
المنتجات والخدمات:
جميع المعلومات المقدمة عبر هذا الموقع بواسطة سيرا أو من ينوب عنها فيما يتعلق بمنتجاتها وخدماتها، سواء في طبيعة البيانات والتوصيات، يعتقد أنها موثوقة، وتبقى المسؤولية على المستخدم للتحقق والتأكد من اكتمال ودقة هذه المعلومات والمنتجات والخدمات. ويخضع بيع جميع المنتجات والخدمات من قبل سيرا للشروط والمعايير التعاقدية وشروط البيع ذات الصلة ، وهي متاحة مجاناً عند الطلب ، ولا تتحمل سيرا أية مسؤولية فيما يتعلق باستخدام منتجات وخدمات أخرى على النحو المبين في هذه الشروط التعاقدية.
الملكية الفكرية:
ما لم يرد نص صريح على خلاف ذلك ، فإن جميع حقوق الملكية الفكرية ، التي تشمل على سبيل المثال لا الحصر : حقوق التأليف ومضمون الرموز والعلامات التجارية والأسماء التجارية وغيرها من المعلومات التي قدمت بشأن ملكية على أو عن طريق هذا الموقع (سواء كانت نصوص، صور أو غيرها من المواد) التي تملكها سيرا أو المرخصة لشركة سيرا هي محمية بالقانون. وتجيز سيرا استخدام مواد من هذا الموقع فقط للاستعمال الشخصي على النحو المبين أعلاه ، وتخضع للمزيد من الشروط التالية :
لا يجوز توزيع أو بيع أي جزء من هذا الموقع لأغراض تجارية أو سياسية.
لا يجوز تعديل أو نسخ أي جزء من هذا الموقع ، مع ملاحظة ظهور حقوق النشر ("من موقع سيرا على الإنترنت") على كل نسخة أو جزء منها ، وتاريخ نسخها.
الحصول على موافقة خطية مسبقة من سيرا لكل ما لم يرد النص عليه أعلاه بخصوص استخدام الملكية الفكرية الواردة في هذا الموقع ، وكل المعلومات المقدمة عليه ، ويمنع منعاً باتاً إساءة استخدام أي من محتوياته.
لا يجوز أن يفسر أي شيء على هذا الموقع على أنه يمنح أي ترخيص أو حق أو أي علامة أو براءة أو أي حق من حقوق الملكية الفكرية لسيرا وعلى وجه الخصوص لا يجوز للمتصفح استخدام علامات سيرا وأسمائها التجارية و/أو عمل أية وصلات نصية هجينة إلى مواقع أخرى دون موافقة خطية مسبقة. وباستخدام هذا الموقع ، يقر المتصفح بعلمه أنه لا يكتسب أية حقوق ملكية على الإطلاق في تنزيل واستخدام أي مادة من الموقع.
ومن دون الإخلال بأية إجراءات جنائية أو مدنية متاحة لسيرا تحتفظ سيرا بحقها في منع أي مستخدم بصفة مؤقتة أو دائمة، إذا كان يُشتَبَه في أنه يرتكب أي انتهاك و/أو يستخدم الموقع لأغراض أو بطرق تخل بالشروط.
القانون الواجب التطبيق والاختصاص القضائي:
يمكن النفاذ إلى الموقع من مختلف بلدان العالم. فلكل من هذه البلدان قوانين قد تختلف عن القوانين والأنظمة المرعية في المملكة العربية السعودية ("السعودية") ، وبالنفاذ إلى هذه الشبكة يوافق المستخدم على أن القوانين السارية في المملكة العربية السعودية (دون أن تترتب عليها أية منازعات قضائية) تنطبق على جميع المسائل المترتبة أو المتعلقة باستخدام محتويات هذا الموقع، أو المعلومات المزودة عبر هذا الموقع، أو المواد الواردة إليه. كما يوافق المستخدم بموجب هذا الاتفاق موافقة غير قابلة للنقض على اختصاص المحاكم المختصة في المملكة العربية السعودية فيما يتعلق بهذه المسائل. وفي حين تبذل سيرا كل جهد ممكن لضمان أن استخدام هذا الموقع يواكب القوانين والأنظمة المرعية ، فإنها لا تضمن أن الموقع أو المعلومات المتاحة خلاله ، أو هذه الشروط تتوافق كلية مع القوانين المطبقة.
النص المعتمد:
قد تكون النسخة العربية لهذه الشروط والأحكام قد ترجمت إلى اللغة الانجليزية أو لغات أخرى، النسخ المترجمة هي خدمة إضافية وهي ترجمة لغير المتحدثين بالعربية، في حال نشوء نزاع حول محتويات أو تفسير هذه الشروط والأحكام أو في حال حدوث اختلاف أو تعارض ما بين النسخة العربية ونسخة بأي لغة أخرى لهذه الشروط والأحكام، فستكون النسخة العربية هي النسخة المطبقة والسائدة والحاسمة.
تجزئة النصوص والأحكام:
إذا أصبح أي من هذه الشروط غير قابل للتطبيق أو باطلاً جزئياً ، يواصل الطرفان الالتزام ببقية الشروط، وتستبدل الأجزاء الباطلة فقط بنصوص من الأحكام الصحيحة والقانونية وذات الأثر القانوني التي تتطابق مع تلك الأجزاء قدر الإمكان ، آخذةً بعين الاعتبار محتوى ومضمون هذه الشروط.
التنازل :
في حالة إخفاق سيرا في ممارسة أو تطبيق أي حق أو حكم من الأحكام المنصوص عليها في هذه الوثيقة، يجب أن لا يشكل ذلك تنازلاً عن ذلك الحق أو النص ويحق لسيرا ممارسة أو تطبيق ذلك الحق أو الحكم في أي وقت.
التعويض:
أنت توافق على تعويض سيرا وحمايتها ضد أي إدعاءات أو خسائر أو أضرار بما في ذلك الرسوم القانونية وأتعاب المحاماة التي قد تترتب على انتهاكك لهذه الشروط أو نتيجة استخدامك للموقع أو إضافة أي محتوى إليه أو نسخك لأي بيانات أو محتويات.
الاتفاقية الكاملة:
تمثل هذه الشروط الاتفاقية الكاملة بين المستخدم وشركة مجموعة سيرا القابضة، وتلغي أية مسئولية و/أو إخطار سابق مرتبط بأي اتصال و/أو معلومات واردة من المستخدم تم نشرها عبر الموقع.""";
}
